tutorials/multiphaseEuler/bubbleColumn/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type    basicMultiphaseSystem;

phases  (air water);

air
{
    type            purePhaseModel;
    diameterModel   isothermal;
    isothermalCoeffs
    {
        d0              3e-3;
        p0              1e5;
    }

    residualAlpha   1e-6;
}

water
{
    type            purePhaseModel;
    diameterModel   constant;
    constantCoeffs
    {
        d               1e-4;
    }

    residualAlpha   1e-6;
}

blending
{
    default
    {
        type            linear;
        minFullyContinuousAlpha.air 0.7;
        minPartlyContinuousAlpha.air 0.3;
        minFullyContinuousAlpha.water 0.7;
        minPartlyContinuousAlpha.water 0.3;
    }

    drag
    {
        type            linear;
        minFullyContinuousAlpha.air 0.7;
        minPartlyContinuousAlpha.air 0.5;
        minFullyContinuousAlpha.water 0.7;
        minPartlyContinuousAlpha.water 0.5;
    }
}

surfaceTension
{
    air_water
    {
        type            constant;
        sigma           0.07;
    }
}

drag
{
    air_dispersedIn_water
    {
        type            SchillerNaumann;
    }

    water_dispersedIn_air
    {
        type            SchillerNaumann;
    }

    air_segregatedWith_water
    {
        type            segregated;
        m               0.5;
        n               8;
    }
}

virtualMass
{
    air_dispersedIn_water
    {
        type            constantCoefficient;
        Cvm             0.5;
    }

    water_dispersedIn_air
    {
        type            constantCoefficient;
        Cvm             0.5;
    }
}

heatTransfer
{
    air_dispersedIn_water
    {
        type            RanzMarshall;
        residualAlpha   1e-4;
    }

    water_dispersedIn_air
    {
        type            RanzMarshall;
        residualAlpha   1e-4;
    }
}

phaseTransfer
{}

lift
{}

wallLubrication
{}

turbulentDispersion
{}

interfaceCompression
{}

// ************************************************************************* //
